app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "private"], ["body", "all things private"], ["status", "private"], ["created_at", "2021-07-06 09:44:57.509432"], ["updated_at", "2021-07-06 09:44:57.509432"]]