app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "status", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", ""], ["body", ""], ["status", "public"], ["article_id", 3], ["created_at", "2021-07-06 09:44:10.206865"], ["updated_at", "2021-07-06 09:44:10.206865"]]
---
    def create
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(comment_params)